app/controllers/movies_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  ORDER BY created_at DESC  [["movie_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_updated_at", "2015-12-11 20:20:05.275174"], ["image_file_name", "iroman.jpeg"], ["updated_at", "2015-12-11 20:20:05.333734"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)