app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id
    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 3], ["comment", "captain america"], ["user_id", 1], ["movie_id", 1], ["created_at", "2015-12-12 20:39:15.668117"], ["updated_at", "2015-12-12 20:39:15.668117"]]